IdeaRS.OpenModel.Concrete.SetupValueEc2
Setup value types Ec2

IdeaRS.OpenModel.Concrete.SetupValueEc2.LimitCheckValue
The limit check value, when check is over - check is not satisfactory

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxDisplayCheckValue
The infinity check value. This will be displayed when the check value equals to infinity
or check wasn't calculated.

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_GammaC
partial factor for concrete for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_GammaS
partial factor for reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_GammaSP
partial factor for prestressed reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_CoeffEpsudByEpsuk
ration of design and characteristics strain limit - reinforcement

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_CoeffEpsudByEpsuk_p
ration of design and characteristics strain limit - prestressed reinforcement

IdeaRS.OpenModel.Concrete.SetupValueEc2.IterationPrecission
Iteration Precission

IdeaRS.OpenModel.Concrete.SetupValueEc2.IterationSteps
Iteration Steps

IdeaRS.OpenModel.Concrete.SetupValueEc2.InteractionDiagramCheckType
InteractionDiagramCheckType

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_7_3_1_Wmax_Ec2_1_1
NA_7_3_1_Wmax_Ec2_1_1

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_7_2_K1
EN 1992-1-1 7.2 (2)
DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (2)

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_7_2_K2
EN 1992-1-1 7.2 (3)
DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (3)

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_7_2_K3
EN 1992-1-1 7.2 (5)
DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (5)

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_7_2_K4
EN 1992-1-1 7.2 (5)
DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (5)

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_7_2_K5
EN 1992-1-1 7.2 (5)
DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (5)

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_7_3_4_K3
NA_7_3_4_K3

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_7_3_4_K4
NA_7_3_4_K4

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_LoadDuration
NA_LoadDuration

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_Alphacc_92_1_1
NA_Alphacc_92_1_1

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_Alphact_92_1_1
NA_Alphact_92_1_1

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_Alphaccpl_92_1_1
NA_Alphaccpl_92_1_1

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_Alphactpl_92_1_1
NA_Alphactpl_92_1_1

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_Alphacc_92_2
NA_Alphacc_92_2

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_Alphact_92_2
NA_Alphact_92_2

IdeaRS.OpenModel.Concrete.SetupValueEc2.Theta
Theta

IdeaRS.OpenModel.Concrete.SetupValueEc2.ThetaMin
ThetaMin

IdeaRS.OpenModel.Concrete.SetupValueEc2.ThetaMax
ThetaMax

IdeaRS.OpenModel.Concrete.SetupValueEc2.CoeffCrdc
CoeffCrdc

IdeaRS.OpenModel.Concrete.SetupValueEc2.CoeffK1
CoeffK1

IdeaRS.OpenModel.Concrete.SetupValueEc2.CoeffVmin
CoeffVmin

IdeaRS.OpenModel.Concrete.SetupValueEc2.CoeffNi1
CoeffNi1

IdeaRS.OpenModel.Concrete.SetupValueEc2.AlphaCw
AlphaCw

IdeaRS.OpenModel.Concrete.SetupValueEc2.CoeffKp
CoeffKp

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinLongReinfPercBeam
detailing beam
minimum long reinf percentage

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxLongReinfPercBeam
maximum long reinf percentage

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinLongReinfDist
minimum long reinf distance

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxLongReinfDist
maximum long reinf distance

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinShearReinfPercBeam
minimum shear reinf percentage

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxShearReinfPercBeam
maximum shear reinf percentage

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxShearReinfDistBeam
maximum shear reinf distance

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxShearReinfTransDist
maximum shear reinf trans distance

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinLongReinfPercColumn
detailing column
minimum long reinf percentage

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxLongReinfPercColumn
maximum long reinf percentage

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinLongReinfDiamColumn
minimum long reinf diameter

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinNoBarCircColumn
minimum number of bars of long reinf

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxShearReinfDistColumn
maximum shear reinf distance

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinShearReinfDiamColumn
minimum shear reinf diameter

IdeaRS.OpenModel.Concrete.SetupValueEc2.StressLimit_TypeFctm
stress limitation - type calculation of concrete stress limitation in tension

IdeaRS.OpenModel.Concrete.SetupValueEc2.CoeffKl
lateral shear - coefficient k (6.2.4 (6))

IdeaRS.OpenModel.Concrete.SetupValueEc2.Theta_t
lateral shear - angle theta - tensioned flange

IdeaRS.OpenModel.Concrete.SetupValueEc2.Theta_c
lateral shear - angle theta - compressed flange

IdeaRS.OpenModel.Concrete.SetupValueEc2.Theta_min_t
lateral shear - min angle theta - tensioned flange

IdeaRS.OpenModel.Concrete.SetupValueEc2.Theta_min_c
lateral shear - min angle theta - compressed flange

IdeaRS.OpenModel.Concrete.SetupValueEc2.Theta_max_f
lateral shear - max angle theta

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_2_5_Theta0
The the basic value of imperfections (See 5.2 (5)).

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_8_6_3_GammaCe
Partial safety factor for second order effect design, see 5.8.6 (3).

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_k_p
ductility factor for prestressed reinforcement

IdeaRS.OpenModel.Concrete.SetupValueEc2.WeakenedByBars
weakened by bars - all bars area is subtract for concrete area

IdeaRS.OpenModel.Concrete.SetupValueEc2.WeakenedByTendons
weakened by tendons - all tendons area is subtract for concrete area

IdeaRS.OpenModel.Concrete.SetupValueEc2.WeakenedByDucts
weakened by ducts - all ducts area is subtract for concrete area

IdeaRS.OpenModel.Concrete.SetupValueEc2.ModulusType
Type of E-modulus, which is used in calculations

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_10_9_r_sup_pre
Effects of prestressing at serviceability limit state and limit state of fatigue
The values of rsup and rinf for use in a Country may be found in its National Annex. The recommended values are:
- for pre-tensioning or unbonded tendons: rsup = 1,05 and rinf = 0,95
- when appropriate measures (e.g. direct measurements of pretensioning) are taken: rsup = rinf = 1,0.

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_10_9_r_inf_pre
Effects of prestressing at serviceability limit state and limit state of fatigue
The values of rsup and rinf for use in a Country may be found in its National Annex. The recommended values are:
- for pre-tensioning or unbonded tendons: rsup = 1,05 and rinf = 0,95
- when appropriate measures (e.g. direct measurements of pretensioning) are taken: rsup = rinf = 1,0.

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_10_9_r_sup_post
Effects of prestressing at serviceability limit state and limit state of fatigue
The values of rsup and rinf for use in a Country may be found in its National Annex. The recommended values are:
- for post-tensioning with bonded tendons: rsup = 1,10 and rinf = 0,90
- when appropriate measures (e.g. direct measurements of pretensioning) are taken: rsup = rinf = 1,0.

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_10_9_r_inf_post
Effects of prestressing at serviceability limit state and limit state of fatigue
The values of rsup and rinf for use in a Country may be found in its National Annex. The recommended values are:
- for post-tensioning with bonded tendons: rsup = 1,10 and rinf = 0,90
- when appropriate measures (e.g. direct measurements of pretensioning) are taken: rsup = rinf = 1,0.

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_2_4_2_2_Gamma_p_fav
Partial factors for prestress
The value of 􀁊P,fav for use in a Country may be found in its National Annex. The recommended value for
persistent and transient design situations is 1,0. This value may also be used for fatigue verification

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_2_4_2_2_Gamma_p_unfav
Partial factors for prestress
The value of 􀁊P,unfav in the stability limit state for use in a Country may be found in its National Annex. The
recommended value for global analysis is 1,3.

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_7_3_1_DecompressionDistance
The durability of prestressed members may be more critically affected by cracking. In the absence of more
detailed requirements, it may be assumed that limiting the calculated crack widths to the values of wmax given
in Table 7.1N, under the frequent combination of loads, will generally be satisfactory for prestressed concrete
members. The decompression limit requires that all parts of the bonded tendons or duct lie at least 100 mm
within concrete in compression

IdeaRS.OpenModel.Concrete.SetupValueEc2.PlaneDiagramCount
Number of the plane interaction diagrams

IdeaRS.OpenModel.Concrete.SetupValueEc2.DivisionStrain
Division of the plane interaction diagram

IdeaRS.OpenModel.Concrete.SetupValueEc2.EndOfCuring
The age of the concrete (days) at the beginning of drying shrinkage (or swelling) in days. Normally this is at the end of curing.

IdeaRS.OpenModel.Concrete.SetupValueEc2.UseGammalt
The safety factor for long-term extrapolation of delayed strains, see Ec2-2 B.105.
Is used for calculation of creep effect. The value Gamma lt is calculated.

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_7_3_1_Wmax_Ec2_2
NA_7_3_1_Wmax_Ec2_2

IdeaRS.OpenModel.Concrete.SetupValueEc2.CheckCrackedCss
Check cracks during shear calculation

IdeaRS.OpenModel.Concrete.SetupValueEc2.UserValuesForShear
User values for shear calculation - d and z

IdeaRS.OpenModel.Concrete.SetupValueEc2.Table74N
Values in table 74N

IdeaRS.OpenModel.Concrete.SetupValueEc2.DecompressionLimit
The decompression limit requires that all parts of the bonded tendons or duct lie at least 25 mm within concrete in compression for 1992-1-1

IdeaRS.OpenModel.Concrete.SetupValueEc2.DecompressionLimit_2
The decompression limit requires that all parts of the bonded tendons or duct lie at least 25 mm within concrete in compression for 1992_2

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinVertReinfPercWall
Minimal reinforcement ratio of vertical reinforcement

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxVertReinfPercWall
Maximal reinforcement ratio of vertical reinforcement

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxVertReinfDistWall
Maximal spacing of vertical reinforcement

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinHorReinfPercWall
Minimal reinforcement ratio of horizontal reinforcement

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxHorReinfDistWall
Maximal spacing of horizontal reinforcement

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinReinfPercDeepBeam
Minimal reinforcement ratio

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxReinfDistDeepBeam
Maximal spacing of reinforcement

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinMainReinfPercSlab
Minimal reinforcement ratio of main reinforcement

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxMainReinfPercSlab
Maximal reinforcement ratio of main reinforcement

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinTransReinfPercSlab
Minimal reinforcement ratio of transverse reinforcement

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxMainReinfDistSlab
Maximal spacing of main reinforcement

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxTransReinfDistSlab
Maximal spacing of transverse reinforcement

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_LimitQuasiPermanent
limit deformation - quasi-permanent deformation

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_LimitCharacteristic
limit deformation - characteristics deformation

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_LimitInfrequent
limit deformation - infrequent deformation

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinTendonVertDist
Minimal vertical distance of tendons

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinTendonHorDist
Minimal horizontal distance of tendons

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinDuctVertDist
Minimal vertical distance of ducts

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinDuctHorDist
Minimal horizontal distance of ducts

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_10_2_1_1_K1
maximum tendon stress coeff k1 in 5.10.2.1(1)P

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_10_2_1_1_K2
maximum tendon stress coeff k2 in 5.10.2.1(1)P

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_10_3_2_K7
maximum tendon stress coeff k7 in 5.10.3(2)

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_10_3_2_K8
maximum tendon stress coeff k8 in 5.10.3(2)

IdeaRS.OpenModel.Concrete.SetupValueEc2.CheckCrossSectionCrackedIfOneCracked_7_2_Chapter
switch if the cross section should be calculated as cracked

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_8_3_2_MinDiameterOfMandrel
minimal diameter of mandrel acc table 8.1N

IdeaRS.OpenModel.Concrete.SetupValueEc2.CoeffNi
strength reduction factor

IdeaRS.OpenModel.Concrete.SetupValueEc2.LimitDeflectionNormal
limit value of deflection for deflection requirement normal

IdeaRS.OpenModel.Concrete.SetupValueEc2.LimitDeflectionAdvanced
limit value of deflection for deflection requrement advanced

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxLengthOfZone
maximum length of zone to divide member for stiffness calculation

IdeaRS.OpenModel.Concrete.SetupValueEc2.LimitDeflectionValue
limit value as value

IdeaRS.OpenModel.Concrete.SetupValueEc2.LinearStiffnessForDeflection
linear stiffness for deflection calculation - only for debug

IdeaRS.OpenModel.Concrete.SetupValueEc2.ImperfectionDirection
direction of imperfection for second order effect

IdeaRS.OpenModel.Concrete.SetupValueEc2.InterpolationCurve
type of interpolate curce

IdeaRS.OpenModel.Concrete.SetupValueEc2.InteractionDiagramDivision
division of interaction diagram for export

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_6_5_2_3_Ni
coefficient ni - SaT

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_6_5_4_4_K1
coefficient k1 - SaT

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_6_5_4_4_K2
coefficient k2 - SaT

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_6_5_4_4_K3
coefficient k3 - SaT

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_J_3_2_K1
coefficient k1 - SaT bracket

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_J_3_3_K2
coefficient k2 - SaT bracket

IdeaRS.OpenModel.Concrete.SetupValueEc2.SaTMethodType
type of SAT method

IdeaRS.OpenModel.Concrete.SetupValueEc2.DetailingBracketMethodType
calculation method of transversal reinforcement

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinAnchLenShear
minimum anchorage length of shear reinforcement

IdeaRS.OpenModel.Concrete.SetupValueEc2.AnchorageDetailType
anchorage of reinforcement according to type

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_GammaFfat
The partial factor for fatigue loads
DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 6.8.4 (1)

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_GammaCfat
partial factor for concrete for fatigue - ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_GammaSfat
partial factor for reinforcement for fatigue - ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_GammaSPfat
partial factor for fatigue - for prestressed reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_TableFatigue63N
table 6.3N for fatigue - parameters for reinforcement steel
DIN EN 1992-1-1/NA:2011-01 April 2013 NCI re 6.8.4, Table 6.3N

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_TableFatigue64N
table 6.4N for fatigue - parameters for prestress steel
DIN EN 1992-1-1/NA:2011-01 April 2013 NCI re 6.8.4, Table 6.4N

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_TableFatigue6101N
table 6.101N for fatigue - parameters for reinforcement steel - Dutch annex

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_NCyclesFatigue
N fatigue cycles 6.8.7 Verification of concrete under compression or shear
DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 6.8.7 (1)

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_K1Fatigue
coefficient k1 for fatigue

IdeaRS.OpenModel.Concrete.SetupValueEc2.SetupTable45n1991_2
table 4.5(n) acc 1991-2 - Indicative number of heavy vehicles expected per year and per slow lane

IdeaRS.OpenModel.Concrete.SetupValueEc2.FatigueMethod
6.8.7 Verification of concrete under compression or shear

IdeaRS.OpenModel.Concrete.SetupValueEc2.CrossSectionCrackedPlate
on - the cross-section is calculated always as cracked

IdeaRS.OpenModel.Concrete.SetupValueEc2.CalculateSrMaxAccUserSettings
sr,max, is calculated according to user

IdeaRS.OpenModel.Concrete.SetupValueEc2.TableJointParameters
6.2.5 (2) Parameters of joint

IdeaRS.OpenModel.Concrete.SetupValueEc2.ModulusTypeLongTermEffects
Type of E-modulus, which is used in calculations of long-term effects

IdeaRS.OpenModel.Concrete.SetupValueEc2.JointShearStressType
Type of shear stress calculation

IdeaRS.OpenModel.Concrete.SetupValueEc2.SubintervalsPerDecade
Minimal number of time nodes per decade

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_5_K1
returns K1 coefficient according to 5.5 EN 1992-1-1

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_5_K2
returns K2 coefficient according to 5.5 EN 1992-1-1

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_5_K3
returns K3 coefficient according to 5.5 EN 1992-1-1

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_5_K4
returns K4 coefficient according to 5.5 EN 1992-1-1

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_5_K5
returns K5 coefficient according to 5.5 EN 1992-1-1
Returns: k5 - coeffciennt

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_5_K6
returns K6 coefficient according to 5.5 EN 1992-1-1

IdeaRS.OpenModel.Concrete.SetupValueEc2.InteractionDiagramExportType
type of interaction diagram for export

IdeaRS.OpenModel.Concrete.SetupValueEc2.IsSetPrecissionForNullForces
settings if null forces are checked with some precissions

IdeaRS.OpenModel.Concrete.SetupValueEc2.NoResistanceOfConcreteInTension1D
No resistance of concrete in tension - members 1D

IdeaRS.OpenModel.Concrete.SetupValueEc2.NeglectRedistributionOfMoments
Neglect redistribution of moments My, Mz, if the ratio My/Mz is less than 10%

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_1_Wmax_Ec2
NA_1_Wmax_Ec2

IdeaRS.OpenModel.Concrete.SetupValueEc2.NonlinearCreep
calculation of non-linear creep

IdeaRS.OpenModel.Concrete.SetupValueEc2.AllowCheckInAgeLess3Days
true to allow check in concrete age less than 3 days

IdeaRS.OpenModel.Concrete.SetupValueEc2.TypeOfInitialstateOfCSS
TypeOfInitialstateOfCSS

IdeaRS.OpenModel.Concrete.SetupValueEc2.BentUpBarsReduction
reduction coefficinet of bent-up bars

IdeaRS.OpenModel.Concrete.SetupValueEc2.StrutAngleOptimalization
calculate optimalization of strut angle in shear, torsion and interaction

IdeaRS.OpenModel.Concrete.SetupValueEc2.IsSetMrForULSMNKappaDiagram
IsSetMrForULSMNKappaDiagram

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_EN1992_3_7_3_1_112_x_min
x lim crack width

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_EN1992_3_CrackWidth
crack width limitation

IdeaRS.OpenModel.Concrete.SetupValueEc2.CracksPassThrough
CracksPassThrough

IdeaRS.OpenModel.Concrete.SetupValueEc2.CracWidthNationalAnnex
use some annex specialities in common eurocode

IdeaRS.OpenModel.Concrete.SetupValueEc2.VestigalResistance
Vestigal resistance

IdeaRS.OpenModel.Concrete.SetupValueEc2.NoTendonExclusion
dont exclude tendons from calculation model of cross-section

IdeaRS.OpenModel.Concrete.SetupValueEc2.HighStrengthConcrete
High strength concrete for DIN NCI re 3.1.2 (6)

IdeaRS.OpenModel.Concrete.SetupValueEc2.InnerPerimeter
Inner perimeter for DIN NCI re 3.1.4 (5)

IdeaRS.OpenModel.Concrete.SetupValueEc2.LimitLeverArm
Limit for lever arm acc. to DIN NCI re 6.2.3 (1)

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_K2Fatigue
6.8.4 (5) Pokud se použijí pravidla 6.8 pro vyhodnocení zbytkové životnosti existující konstrukce nebo pro
posouzení potřeby jejího zesílení, pak pokud začala koroze, lze stanovit rozkmit napětí sníženým
exponentem napětí k2 pro přímé a ohýbané pruty
/// DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 6.8.4 (5)

IdeaRS.OpenModel.Concrete.SetupValueEc2.DecompressionLimit_3
NCI re 7.3.1 (5)
In order to keep within the decompression limit, it is required that the concrete surrounding the tendon is in compression over a width of 100 mm
or 1/10 of the depth of section (whichever is greater). Stresses are to be checked in state II.

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_TableFatigue63N_1992_2
table 6.3N for fatigue - parameters for reinforcement steel
DIN EN 1992-2/NA 2013 NCI re 6.8.4, Table 6.3N

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_TableFatigue64N_1992_2
table 6.4N for fatigue - parameters for prestress steel
DIN EN 1992-2/NA April 2013 NCI re 6.8.4, Table 6.4N

IdeaRS.OpenModel.Concrete.SetupValueEc2.IncreaseJointResistance
the bearing capacity of the reinforcement crossing the joint due to shear friction (third term of the equation) may be increased to become ρ fyd (1,2 μ sin α + cos α).

IdeaRS.OpenModel.Concrete.SetupValueEc2.Equation629
Equation 6.29 acc. to DIN NCI re 6.3.2 (4)

IdeaRS.OpenModel.Concrete.SetupValueEc2.Equation631
Equation 6.31 acc. to DIN NCI re 6.3.2 (5)

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_Table7_101DE_1992_2
NDP zu 7.3.1 (105) Es gelten Tabelle 7.101DE

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_Table7_102DE_1992_2
NDP zu 7.3.1 (105) Es gelten Tabelle 7.102DE

IdeaRS.OpenModel.Concrete.SetupValueEc2.FatigueJointCohesion
Under fatigue or dynamic loads, the values for c in 6.2.5 (1) should be halved.

IdeaRS.OpenModel.Concrete.SetupValueEc2.Table74N_1992_1_1
Values in table 74N

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_Table7_103DE_1992_2
NDP zu 7.3.1 (105) Es gelten Tabelle 7.103DE

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxBentUpReinfDist
maximum longitudinal spacing of bent-up bars

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinShearReinfPercSlab
Minimal shear reinforcement percentage for slab

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxShearReinfDistSlab
maximum longitudinal spacing of successive series of links for slab

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxShearReinfTransDistSlab
maximum transverse spacing of shear reinforcement for slab

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinShearReinfDiamColumn_EN2_2
minimum shear reinf diameter EN2-2

IdeaRS.OpenModel.Concrete.SetupValueEc2.CoeffNi1_EN2_2
coeff ni1 for EN2-2

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinLongReinfPercBeam_EN2_2
minimum long reinf percentage for EN2-2

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxLongReinfPercBeam_EN2_2
maximum long reinf percentage for EN2-2

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxMainReinfDistSlab_EN2_2
maximum main long reinf distance for EN2-2

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxTransReinfDistSlab_EN2_2
maximum transversal long reinf distance for EN2-2

IdeaRS.OpenModel.Concrete.SetupValueEc2.MaxHorReinfDistWall_EN2_2
maximum horizontal long reinf distance for EN2-2

IdeaRS.OpenModel.Concrete.SetupValueEc2.MinReinfPercDeepBeam_EN2_2
minimum long reinf percentage for EN2-2

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_5_K5_fck_BiggerThan_50MPa
returns K5 coefficient according to DIN EN 1992-2/NA April 2013 NDP re 5.5 (4)
Returns: k5 - coeffciennt

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_5_5_K6_fck_BiggerThan_50MPa
returns K5 coefficient according to DIN EN 1992-2/NA April 2013NDP re 5.5 (4)
Returns: k5 - coeffciennt

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_7_3_4_K1
is a coefficient which takes account of the bond properties of the bonded reinforcement

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_7_3_4_K2
is a coefficient which takes account of the distribution of strain

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_NN_112_Gamma_sd
coefficient

IdeaRS.OpenModel.Concrete.SetupValueEc2.CoefficientOfTensionConcrete
coefficient witch reduce the tension strength

IdeaRS.OpenModel.Concrete.SetupValueEc2.FindOnly2DPlaneDeformation
FindOnly2DPlaneDeformation

IdeaRS.OpenModel.Concrete.SetupValueEc2.SimplifiedCssModel
Use simplified calculation model of cross-section (reinforcement bars in layers are substituted by rectangle polygon component)

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_GammaC_BLR
BLR partial factor for concrete for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_GammaS_BLR
BLR partial factor for reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_GammaSP_BLR
partial factor for prestressed reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double

IdeaRS.OpenModel.Concrete.SetupValueEc2.BLRPRecisionCheckValue
precision of bridge load rating - check value

IdeaRS.OpenModel.Concrete.SetupValueEc2.TypeSLSCalculation
set of SLS calculation
0 - both
1 - short-term
2 - long-term

IdeaRS.OpenModel.Concrete.SetupValueEc2.NoResistanceOfConcreteInTension2D
No resistance of concrete in tension - plates

IdeaRS.OpenModel.Concrete.SetupValueEc2.NumberPartsOfDM
number of parts on design member

IdeaRS.OpenModel.Concrete.SetupValueEc2.CalculateShrinkage
calculate influence of shrinkage to stiffnesses

IdeaRS.OpenModel.Concrete.SetupValueEc2.NA_EN1992_3_CrackWidth_XA2_XA3_XF2_XF3_XF4
crack width limitation

IdeaRS.OpenModel.Concrete.SetupValueEc2.CalculationOfStressLimitationK1
calculation of stress limitation k1

IdeaRS.OpenModel.Concrete.SetupValueEc2.CalculationOfStressLimitationK2
calculation of stress limitation k2

IdeaRS.OpenModel.Concrete.SetupValueEc2.CalculationOfStressLimitationK3
calculation of stress limitation k3